SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/smtc_modem_crypto/efr32_secure_element/smtc_secure_element_efr32.c
/**
 * @file      smtc_secure_element_efr32.c
 *
 * @brief     EFR32 Secure Element implementation using Silicon Labs hardware crypto
 *
 * The Clear BSD License
 * Copyright Semtech Corporation 2021. All rights reserved.
 * Modified for EFR32XG28 hardware crypto support
 * Copyright 2025 Silicon Laboratories Inc. www.silabs.com
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted (subject to the limitations in the disclaimer
 * below) provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the Semtech corporation nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY
 * THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT
 * NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL SEMTECH CORPORATION BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

/*
 * -----------------------------------------------------------------------------
 * --- DEPENDENCIES ------------------------------------------------------------
 */

#include <stdint.h>   // C99 types
#include <stdbool.h>  // bool type
#include <stdlib.h>   // for malloc/free

#include "smtc_secure_element.h"

// Silicon Labs Hardware Crypto includes
#include "sl_se_manager.h"
#include "sl_se_manager_cipher.h"
#include "sl_se_manager_key_handling.h"
#include "sl_se_manager_types.h"
#include "sl_se_manager_defines.h"
#include "sl_memory_manager.h"

#include "smtc_modem_hal.h"
#include "smtc_hal_dbg_trace.h"

#include <string.h>  //for memset, memcpy

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE MACROS-----------------------------------------------------------
 */
#define WRAPPER_NAME(function) __wrap_##function

/*!
 * Number of keys supported in EFR32 secure element
 */
#define EFR32_SE_NUMBER_OF_KEYS 27

/*!
 * JoinAccept frame maximum size
 */
#define JOIN_ACCEPT_FRAME_MAX_SIZE 33

/*!
 * Lorawan MIC size
 */
#define LORWAN_MIC_FIELD_SIZE 4

/*!
 * Lorawan MHDR SIZE
 */
#define LORAMAC_MHDR_FIELD_SIZE 1

/*!
 * EFR32 SE key ID base - using application key range
 */
#define EFR32_SE_KEY_ID_BASE 0x81000000

/*!
 * AES block size in bytes
 */
#define AES_BLOCK_SIZE                       16

/*!
 * LoRaWAN B0 block size (for CMAC calculation)
 */
#define LORAWAN_B0_BLOCK_SIZE                16

/*!
 * AES block alignment mask (block_size - 1)
 */
#define AES_BLOCK_ALIGNMENT_MASK             15

/*!
 * LoRaWAN JoinAccept DLSettings byte offset (from start of message)
 */
#define LORAWAN_JOIN_ACCEPT_DLSETTINGS_OFFSET    11

/*!
 * LoRaWAN version minor bit mask in DLSettings byte
 * Bit 7: 0 = LoRaWAN 1.0.x, 1 = LoRaWAN 1.1.x
 */
#define LORAWAN_VERSION_MINOR_BIT_MASK           0x80

/*!
 * LoRaWAN 1.0.x version minor value
 */
#define LORAWAN_VERSION_MINOR_1_0                0

/*!
 * LoRaWAN 1.1.x version minor value
 */
#define LORAWAN_VERSION_MINOR_1_1                1

#define EFR32_SE_KEY_LIST                                                                  \
  {                                                                                        \
    { .key_id = SMTC_SE_APP_KEY, .is_set = false, .is_hardware_key = false },              \
    { .key_id = SMTC_SE_NWK_KEY, .is_set = false, .is_hardware_key = false },              \
    { .key_id = SMTC_SE_J_S_INT_KEY, .is_set = false, .is_hardware_key = false },          \
    { .key_id = SMTC_SE_J_S_ENC_KEY, .is_set = false, .is_hardware_key = false },          \
    { .key_id = SMTC_SE_F_NWK_S_INT_KEY, .is_set = false, .is_hardware_key = false },      \
    { .key_id = SMTC_SE_S_NWK_S_INT_KEY, .is_set = false, .is_hardware_key = false },      \
    { .key_id = SMTC_SE_NWK_S_ENC_KEY, .is_set = false, .is_hardware_key = false },        \
    { .key_id = SMTC_SE_APP_S_KEY, .is_set = false, .is_hardware_key = false },            \
    { .key_id = SMTC_SE_MC_ROOT_KEY, .is_set = false, .is_hardware_key = false },          \
    { .key_id = SMTC_SE_MC_KE_KEY, .is_set = false, .is_hardware_key = false },            \
    { .key_id = SMTC_SE_MC_KEY_0, .is_set = false, .is_hardware_key = false },             \
    { .key_id = SMTC_SE_MC_APP_S_KEY_0, .is_set = false, .is_hardware_key = false },       \
    { .key_id = SMTC_SE_MC_NWK_S_KEY_0, .is_set = false, .is_hardware_key = false },       \
    { .key_id = SMTC_SE_MC_KEY_1, .is_set = false, .is_hardware_key = false },             \
    { .key_id = SMTC_SE_MC_APP_S_KEY_1, .is_set = false, .is_hardware_key = false },       \
    { .key_id = SMTC_SE_MC_NWK_S_KEY_1, .is_set = false, .is_hardware_key = false },       \
    { .key_id = SMTC_SE_MC_KEY_2, .is_set = false, .is_hardware_key = false },             \
    { .key_id = SMTC_SE_MC_APP_S_KEY_2, .is_set = false, .is_hardware_key = false },       \
    { .key_id = SMTC_SE_MC_NWK_S_KEY_2, .is_set = false, .is_hardware_key = false },       \
    { .key_id = SMTC_SE_MC_KEY_3, .is_set = false, .is_hardware_key = false },             \
    { .key_id = SMTC_SE_MC_APP_S_KEY_3, .is_set = false, .is_hardware_key = false },       \
    { .key_id = SMTC_SE_MC_NWK_S_KEY_3, .is_set = false, .is_hardware_key = false },       \
    { .key_id = SMTC_SE_RELAY_ROOT_WOR_S_KEY, .is_set = false, .is_hardware_key = false }, \
    { .key_id = SMTC_SE_RELAY_WOR_S_INT_KEY, .is_set = false, .is_hardware_key = false },  \
    { .key_id = SMTC_SE_RELAY_WOR_S_ENC_KEY, .is_set = false, .is_hardware_key = false },  \
    { .key_id = SMTC_SE_DATA_BLOCK_INT_KEY, .is_set = false, .is_hardware_key = false },   \
    { .key_id = SMTC_SE_SLOT_RAND_ZERO_KEY, .is_set = false, .is_hardware_key = false },   \
  }

