SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/smtc_modem_crypto/efr32_secure_element/smtc_secure_element_efr32.c
/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE TYPES -----------------------------------------------------------
 */

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE VARIABLES -------------------------------------------------------
 */

/**
 * @brief EFR32 key storage element structure
 */
typedef struct efr32_se_key_s{
  smtc_se_key_identifier_t key_id;                        //!< Key identifier
  sl_se_key_descriptor_t   se_key_desc;                  //!< SE Manager key descriptor
  uint8_t                  key_buffer[SMTC_SE_KEY_SIZE];   //!< Key storage buffer
  bool                     is_set;                        //!< Flag indicating if key is set
  bool                     is_hardware_key;               //!< Flag indicating if key is stored in hardware
} efr32_se_key_t;

/**
 * @brief EFR32 Secure element context structure
 */
typedef struct efr32_se_context_s{
  efr32_se_key_t key_list[EFR32_SE_NUMBER_OF_KEYS];      //!< Key list (27 keys as per SMTC spec)
  uint8_t        dev_eui[SMTC_SE_EUI_SIZE];              //!< DevEUI storage
  uint8_t        join_eui[SMTC_SE_EUI_SIZE];             //!< JoinEUI storage
  uint8_t        pin[SMTC_SE_PIN_SIZE];                  //!< Pin storage
  sl_se_command_context_t cmd_ctx;                       //!< SE Manager command context
} efr32_se_context_t;

/**
 * @brief EFR32 secure element context
 */
static efr32_se_context_t efr32_se_ctx;

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DECLARATION -------------------------------------------
 */

/**
 * @brief Get key from key list
 *
 * @param [in] key_id Key identifier
 * @param [in] key Pointer to the key
 * @return Secure element return code as defined in @ref smtc_se_return_code_t
 */
static smtc_se_return_code_t get_key_by_id(smtc_se_key_identifier_t key_id, efr32_se_key_t** key);

/**
 * @brief Set key in key list with hardware storage
 *
 * @param [in] key_id Key identifier
 * @param [in] key Key value
 * @return Secure element return code as defined in @ref smtc_se_return_code_t
 */
static smtc_se_return_code_t set_key_by_id(smtc_se_key_identifier_t key_id, const uint8_t key[SMTC_SE_KEY_SIZE]);

/**
 * @brief Initialize a hardware key in the SE Manager
 *
 * @param [in] key Pointer to the key structure
 * @param [in] key_data Key data to store
 * @return Secure element return code as defined in @ref smtc_se_return_code_t
 */
static smtc_se_return_code_t efr32_se_init_hardware_key(efr32_se_key_t* key, const uint8_t* key_data);

/**
 * @brief Compute CMAC using EFR32 hardware
 *
 * @param [in] key_desc SE key descriptor
 * @param [in] data Input data
 * @param [in] data_len Input data length
 * @param [out] mac Output MAC (16 bytes)
 * @return Secure element return code as defined in @ref smtc_se_return_code_t
 */
static smtc_se_return_code_t efr32_se_compute_cmac(const sl_se_key_descriptor_t* key_desc,
                                                   const uint8_t* data,
                                                   size_t data_len,
                                                   uint8_t* mac);

/**
 * @brief Perform AES encryption using EFR32 hardware
 *
 * @param [in] key_desc SE key descriptor
 * @param [in] input Input data (must be multiple of 16 bytes)
 * @param [in] input_len Input data length
 * @param [out] output Output buffer
 * @return Secure element return code as defined in @ref smtc_se_return_code_t
 */
static smtc_se_return_code_t efr32_se_aes_encrypt(const sl_se_key_descriptor_t* key_desc,
                                                  const uint8_t* input,
                                                  size_t input_len,
                                                  uint8_t* output);

/*
 * -----------------------------------------------------------------------------
 * --- PUBLIC FUNCTIONS DEFINITIONS --------------------------------------------
 */
smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_init)(void)
{
  // Initialize SE Manager
  sl_status_t status = sl_se_init();
  if ( status != SL_STATUS_OK ) {
    printf("EFR32 SE Manager init failed: 0x%lx\n", status);
    return SMTC_SE_RC_ERROR;
  }

  // Initialize context
  memset(&efr32_se_ctx, 0, sizeof(efr32_se_ctx) );

  // Initialize key list
  efr32_se_key_t key_list_init[EFR32_SE_NUMBER_OF_KEYS] = EFR32_SE_KEY_LIST;
  memcpy(efr32_se_ctx.key_list, key_list_init, sizeof(key_list_init) );

  // Initialize SE command context
  status = sl_se_init_command_context(&efr32_se_ctx.cmd_ctx);
  if ( status != SL_STATUS_OK ) {
    printf("EFR32 SE command context init failed: 0x%lx\n", status);
    return SMTC_SE_RC_ERROR;
  }

  printf("EFR32 hardware crypto secure element initialized\n");
  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_set_key)(smtc_se_key_identifier_t key_id, const uint8_t key[SMTC_SE_KEY_SIZE],
                                                                uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( key == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  return set_key_by_id(key_id, key);
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_compute_aes_cmac)(const uint8_t * mic_bx_buffer, const uint8_t * buffer,
                                                                         uint16_t size, smtc_se_key_identifier_t key_id,
                                                                         uint32_t * cmac, uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( (buffer == NULL) || (cmac == NULL) ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  efr32_se_key_t* key;
  smtc_se_return_code_t rc = get_key_by_id(key_id, &key);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }

  if ( !key->is_set ) {
    return SMTC_SE_RC_ERROR_INVALID_KEY_ID;
  }

  // Prepare data for CMAC calculation
  const uint8_t* cmac_data;
  size_t cmac_data_size = size;
  uint8_t* temp_data = NULL;

  if ( mic_bx_buffer != NULL ) {
    // Concatenate B0 block and data
    cmac_data_size = LORAWAN_B0_BLOCK_SIZE + size;
    temp_data = sl_malloc(cmac_data_size);
    if ( temp_data == NULL ) {
      return SMTC_SE_RC_ERROR;
    }
    memcpy(temp_data, mic_bx_buffer, LORAWAN_B0_BLOCK_SIZE);
    memcpy(temp_data + LORAWAN_B0_BLOCK_SIZE, buffer, size);
    cmac_data = temp_data;
  } else {
    cmac_data = buffer;
  }

  uint8_t mac[16];

  // Use EFR32 hardware CMAC
  smtc_se_return_code_t cmac_rc = efr32_se_compute_cmac(&key->se_key_desc, cmac_data, cmac_data_size, mac);

  if ( mic_bx_buffer != NULL ) {
    sl_free(cmac_data);
  }

  if ( cmac_rc != SMTC_SE_RC_SUCCESS ) {
    return cmac_rc;
  }

  // Copy first 4 bytes as CMAC result
  memcpy(cmac, mac, 4);

  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_verify_aes_cmac)(uint8_t * buffer, uint16_t size, uint32_t expected_cmac, // NOSONAR
                                                                        smtc_se_key_identifier_t key_id, uint8_t stack_id)
{
  if ( buffer == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

