SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/smtc_modem_crypto/efr32_secure_element/smtc_secure_element_efr32.c
  // Verify CMAC using hardware implementation
  uint32_t computed_cmac;
  smtc_se_return_code_t rc = smtc_secure_element_compute_aes_cmac(NULL, buffer, size, key_id, &computed_cmac, stack_id);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }

  if ( computed_cmac != expected_cmac ) {
    return SMTC_SE_RC_FAIL_CMAC;
  }

  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_aes_encrypt)(const uint8_t * buffer, uint16_t size,
                                                                    smtc_se_key_identifier_t key_id, uint8_t * enc_buffer,
                                                                    uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( (buffer == NULL) || (enc_buffer == NULL) ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  if ( size % 16 != 0 ) {
    return SMTC_SE_RC_ERROR_BUF_SIZE;
  }

  efr32_se_key_t* key;
  smtc_se_return_code_t rc = get_key_by_id(key_id, &key);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }

  if ( !key->is_set ) {
    return SMTC_SE_RC_ERROR_INVALID_KEY_ID;
  }

  // Use EFR32 hardware AES encryption
  smtc_se_return_code_t aes_rc = efr32_se_aes_encrypt(&key->se_key_desc, buffer, size, enc_buffer);

  if ( aes_rc != SMTC_SE_RC_SUCCESS ) {
    return aes_rc;
  }

  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_derive_and_store_key)(uint8_t * input, smtc_se_key_identifier_t rootkey_id, // NOSONAR
                                                                             smtc_se_key_identifier_t targetkey_id,
                                                                             uint8_t                  stack_id)
{
  if ( input == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  efr32_se_key_t* root_key;
  smtc_se_return_code_t rc = get_key_by_id(rootkey_id, &root_key);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }

  if ( !root_key->is_set ) {
    return SMTC_SE_RC_ERROR_INVALID_KEY_ID;
  }

  // Derive key by encrypting input with root key (AES-ECB)
  uint8_t derived_key[SMTC_SE_KEY_SIZE];
  rc = smtc_secure_element_aes_encrypt(input, SMTC_SE_KEY_SIZE, rootkey_id, derived_key, stack_id);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }

  // Store derived key
  return set_key_by_id(targetkey_id, derived_key);
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_derive_relay_session_keys)(uint32_t dev_addr, uint8_t stack_id)
{
  uint8_t block[16];
  memset(block, 0, sizeof(block) );
  block[0] = 0x01;

  smtc_se_return_code_t rc = smtc_secure_element_derive_and_store_key(block, SMTC_SE_NWK_S_ENC_KEY,
                                                                      SMTC_SE_RELAY_ROOT_WOR_S_KEY,
                                                                      stack_id);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }
  memset(block, 0, sizeof(block) );
  block[0] = 0x01;
  block[1] = ( uint8_t ) (dev_addr);
  block[2] = ( uint8_t ) (dev_addr >> 8);
  block[3] = ( uint8_t ) (dev_addr >> 16);
  block[4] = ( uint8_t ) (dev_addr >> 24);

  rc = smtc_secure_element_derive_and_store_key(block, SMTC_SE_RELAY_ROOT_WOR_S_KEY,
                                                SMTC_SE_RELAY_WOR_S_INT_KEY,
                                                stack_id);

  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }

  memset(block, 0, sizeof(block) );
  block[0] = 0x02;
  block[1] = ( uint8_t ) (dev_addr);
  block[2] = ( uint8_t ) (dev_addr >> 8);
  block[3] = ( uint8_t ) (dev_addr >> 16);
  block[4] = ( uint8_t ) (dev_addr >> 24);
  rc = smtc_secure_element_derive_and_store_key(block, SMTC_SE_RELAY_ROOT_WOR_S_KEY,
                                                SMTC_SE_RELAY_WOR_S_ENC_KEY,
                                                stack_id);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }

  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_process_join_accept)(smtc_se_join_req_identifier_t join_req_type,
                                                                            uint8_t joineui[SMTC_SE_EUI_SIZE], uint16_t dev_nonce, // NOSONAR
                                                                            const uint8_t * enc_join_accept,
                                                                            uint8_t enc_join_accept_size, uint8_t * dec_join_accept,
                                                                            uint8_t * version_minor, uint8_t stack_id)
{
  UNUSED(joineui);
  UNUSED(dev_nonce);
  if ((enc_join_accept == NULL) || (dec_join_accept == NULL) || (version_minor == NULL)) {
    return SMTC_SE_RC_ERROR_NPE;
  }
  if (enc_join_accept_size > JOIN_ACCEPT_FRAME_MAX_SIZE) {
    return SMTC_SE_RC_ERROR_BUF_SIZE;
  }

  // Determine decryption key
  smtc_se_key_identifier_t enckey_id = SMTC_SE_NWK_KEY;
  if (join_req_type != SMTC_SE_JOIN_REQ) {
    enckey_id = SMTC_SE_J_S_ENC_KEY;
  }

  memcpy(dec_join_accept, enc_join_accept, enc_join_accept_size);

  // Decrypt JoinAccept, skip MHDR
  if (smtc_secure_element_aes_encrypt(
        enc_join_accept + LORAMAC_MHDR_FIELD_SIZE,
        enc_join_accept_size - LORAMAC_MHDR_FIELD_SIZE,
        enckey_id,
        dec_join_accept + LORAMAC_MHDR_FIELD_SIZE,
        stack_id) != SMTC_SE_RC_SUCCESS) {
    return SMTC_SE_RC_FAIL_ENCRYPT;
  }

  *version_minor = ((dec_join_accept[LORAWAN_JOIN_ACCEPT_DLSETTINGS_OFFSET] & LORAWAN_VERSION_MINOR_BIT_MASK) == LORAWAN_VERSION_MINOR_BIT_MASK) ? LORAWAN_VERSION_MINOR_1_1 : LORAWAN_VERSION_MINOR_1_0;

  uint32_t mic = 0;
  mic = ((uint32_t)dec_join_accept[enc_join_accept_size - LORWAN_MIC_FIELD_SIZE] << 0);
  mic |= ((uint32_t)dec_join_accept[enc_join_accept_size - LORWAN_MIC_FIELD_SIZE + 1] << 8);
  mic |= ((uint32_t)dec_join_accept[enc_join_accept_size - LORWAN_MIC_FIELD_SIZE + 2] << 16);
  mic |= ((uint32_t)dec_join_accept[enc_join_accept_size - LORWAN_MIC_FIELD_SIZE + 3] << 24);

  // Verify mic
  if (*version_minor == 0) {
    // LoRaWAN 1.0.x: MIC = aes128_cmac(NwkKey, MHDR | ... | CFList)
    if (smtc_secure_element_verify_aes_cmac(
          dec_join_accept,
          (enc_join_accept_size - LORWAN_MIC_FIELD_SIZE),
          mic,
          SMTC_SE_NWK_KEY,
          stack_id) != SMTC_SE_RC_SUCCESS) {
      return SMTC_SE_RC_FAIL_CMAC;
    }
  } else {
    return SMTC_SE_RC_ERROR_INVALID_LORAWAM_SPEC_VERSION;
  }

  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_set_deveui)(const uint8_t deveui[SMTC_SE_EUI_SIZE], uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( deveui == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  memcpy(efr32_se_ctx.dev_eui, deveui, SMTC_SE_EUI_SIZE);
  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_get_deveui)(uint8_t deveui[SMTC_SE_EUI_SIZE], uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( deveui == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  memcpy(deveui, efr32_se_ctx.dev_eui, SMTC_SE_EUI_SIZE);
  return SMTC_SE_RC_SUCCESS;
}

