SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/smtc_modem_crypto/efr32_secure_element/smtc_secure_element_efr32.c
smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_set_joineui)(const uint8_t joineui[SMTC_SE_EUI_SIZE], uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( joineui == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  memcpy(efr32_se_ctx.join_eui, joineui, SMTC_SE_EUI_SIZE);
  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_get_joineui)(uint8_t joineui[SMTC_SE_EUI_SIZE], uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( joineui == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  memcpy(joineui, efr32_se_ctx.join_eui, SMTC_SE_EUI_SIZE);
  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_set_pin)(const uint8_t pin[SMTC_SE_PIN_SIZE], uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( pin == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  memcpy(efr32_se_ctx.pin, pin, SMTC_SE_PIN_SIZE);
  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_get_pin)(uint8_t pin[SMTC_SE_PIN_SIZE], uint8_t stack_id)
{
  UNUSED(stack_id);

  if ( pin == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  memcpy(pin, efr32_se_ctx.pin, SMTC_SE_PIN_SIZE);
  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_store_context)(uint8_t stack_id)
{
  UNUSED(stack_id);

  // Store context to NVM using HAL context functions
  smtc_modem_hal_context_store(CONTEXT_SECURE_ELEMENT, 0, (const uint8_t*)&efr32_se_ctx, sizeof(efr32_se_ctx) );
  return SMTC_SE_RC_SUCCESS;
}

smtc_se_return_code_t WRAPPER_NAME(smtc_secure_element_restore_context)(uint8_t stack_id)
{
  UNUSED(stack_id);

  // Restore context from NVM using HAL context functions
  smtc_modem_hal_context_restore(CONTEXT_SECURE_ELEMENT, 0, (uint8_t*)&efr32_se_ctx, sizeof(efr32_se_ctx) );

  // Re-initialize SE Manager after restore
  sl_status_t status = sl_se_init_command_context(&efr32_se_ctx.cmd_ctx);
  if ( status != SL_STATUS_OK ) {
    printf("EFR32 SE command context restore failed: 0x%lx\n", status);
    return SMTC_SE_RC_ERROR;
  }

  return SMTC_SE_RC_SUCCESS;
}

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DEFINITIONS -------------------------------------------
 */
static smtc_se_return_code_t get_key_by_id(smtc_se_key_identifier_t key_id, efr32_se_key_t** key)
{
  for ( uint8_t i = 0; i < EFR32_SE_NUMBER_OF_KEYS; i++ ) {
    if ( efr32_se_ctx.key_list[i].key_id == key_id ) {
      *key = &(efr32_se_ctx.key_list[i]);
      return SMTC_SE_RC_SUCCESS;
    }
  }
  return SMTC_SE_RC_ERROR_INVALID_KEY_ID;
}

static smtc_se_return_code_t set_key_by_id(smtc_se_key_identifier_t key_id, const uint8_t key[SMTC_SE_KEY_SIZE])
{
  efr32_se_key_t* key_item;
  smtc_se_return_code_t rc = get_key_by_id(key_id, &key_item);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    return rc;
  }

  uint8_t final_key[SMTC_SE_KEY_SIZE];

  if ( (key_id == SMTC_SE_MC_KEY_0) || (key_id == SMTC_SE_MC_KEY_1)
       || (key_id == SMTC_SE_MC_KEY_2) || (key_id == SMTC_SE_MC_KEY_3) ) {
    rc = smtc_secure_element_aes_encrypt(
      key, SMTC_SE_KEY_SIZE, SMTC_SE_MC_KE_KEY, final_key, 0);
    if ( rc != SMTC_SE_RC_SUCCESS ) {
      return rc;
    }
  } else {
    memcpy(final_key, key, SMTC_SE_KEY_SIZE);
  }

  // Copy key value to buffer
  memcpy(key_item->key_buffer, final_key, SMTC_SE_KEY_SIZE);

  // Initialize hardware key
  rc = efr32_se_init_hardware_key(key_item, final_key);
  if ( rc != SMTC_SE_RC_SUCCESS ) {
    printf("Failed to initialize hardware key for key_id=%d\n", key_id);
    return rc;
  }

  key_item->is_set = true;
  return SMTC_SE_RC_SUCCESS;
}

static smtc_se_return_code_t efr32_se_init_hardware_key(efr32_se_key_t* key, const uint8_t* key_data)
{
  if ( key == NULL || key_data == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  // Initialize key descriptor for plaintext key storage
  sl_se_key_descriptor_t* desc = &key->se_key_desc;

  desc->type = SL_SE_KEY_TYPE_AES_128;
  desc->flags = 0;    // No special flags for symmetric AES key
  desc->storage.method = SL_SE_KEY_STORAGE_EXTERNAL_PLAINTEXT;
  desc->storage.location.buffer.pointer = key->key_buffer;
  desc->storage.location.buffer.size = SMTC_SE_KEY_SIZE;

  key->is_hardware_key = true;
  return SMTC_SE_RC_SUCCESS;
}

static smtc_se_return_code_t efr32_se_compute_cmac(const sl_se_key_descriptor_t* key_desc,
                                                   const uint8_t* data,
                                                   size_t data_len,
                                                   uint8_t* mac)
{
  if ( key_desc == NULL || data == NULL || mac == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  // Use SE Manager to compute CMAC
  sl_status_t status = sl_se_cmac(&efr32_se_ctx.cmd_ctx,
                                  key_desc,
                                  data,
                                  data_len,
                                  mac);

  if ( status != SL_STATUS_OK ) {
    return SMTC_SE_RC_ERROR;
  }

  return SMTC_SE_RC_SUCCESS;
}

static smtc_se_return_code_t efr32_se_aes_encrypt(const sl_se_key_descriptor_t* key_desc,
                                                  const uint8_t* input,
                                                  size_t input_len,
                                                  uint8_t* output)
{
  if ( key_desc == NULL || input == NULL || output == NULL ) {
    return SMTC_SE_RC_ERROR_NPE;
  }

  // Use SE Manager for AES-ECB encryption
  sl_status_t status = sl_se_aes_crypt_ecb(&efr32_se_ctx.cmd_ctx,
                                           key_desc,
                                           SL_SE_ENCRYPT,
                                           input_len,
                                           input,
                                           output);

  if ( status != SL_STATUS_OK ) {
    return SMTC_SE_RC_FAIL_ENCRYPT;
  }
  return SMTC_SE_RC_SUCCESS;
}

/* --- EOF ------------------------------------------------------------------ */
